Revit 2026 API

# WireSizeSetInsert Method

---

Insert the specified wire size into the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Insert(
	WireSize item
)
```
```vb
Public Overridable Function Insert (
	item As WireSize
) As Boolean
```
```cpp
public:
virtual bool Insert(
	WireSize^ item
)
```
```fsharp
abstract Insert :
        item : WireSize -> bool
override Insert :
        item : WireSize -> bool
```

#### Parameters

item WireSize
    The wire size to be inserted into the set.

#### Return Value

BooleanReturns whether the wire size was inserted into the set.

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace